Revit 2025 API
FabricationPartBrowserOperation Enumeration
 Operations for the FabricationPartBrowserChangedEventArgs Event
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricationPartBrowserOperation
Public Enumeration FabricationPartBrowserOperation
public enum class FabricationPartBrowserOperation
type FabricationPartBrowserOperation
Members
Member name | Value | Description
ShowBrowser | 0 |  Show browser window
HideBrowser | 1 |  Hide browser window
ShowService | 2 |  Select current service
StartRoutingSolutionMode | 3 |  Start routing solution mode
CreatedRoutingSolutions | 4 |  Routing solutions (re)created
RoutingSolutionChanged | 5 |  Active Routing solution has changed
FinishRoutingSolutionMode | 6 |  Finish routing solution mode
StartMPRoutingMode | 7 |  Start multi-point routing mode
FinishMPRoutingMode | 8 |  Finish multi-point routing mode
StartServiceSwapOutMode | 9 |  Start service swap-out mode
UnknownOperation | -1 |  Unknown operation
FinishServiceSwapOutMode | 10 |  Finish service swap-out mode
UpdateServiceSwapOutPartTypes | 11 |  Service swap out part type mappings has changed.
UpdateServiceSwapOutSizes | 12 |  Service swap out size mappings has changed.
StartSizeSwapOutMode | 13 |  Start size swap-out mode.
FinishSizeSwapOutMode | 14 |  Finish size swap out mode.
SwitchToInlineFittingsTab | 15 |  Make the inline fittings tab active in Change Service.
See Also
Reference
Autodesk.Revit.UI.Events Namespace